3B/SE464/08-Microservices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-07 Sat 18:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Microservices</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Microservices</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc87e02b">1. Monolithic Design</a></li>
<li><a href="#orge1788cf">2. Microservices</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc87e02b" class="outline-2">
<h2 id="orgc87e02b"><span class="section-number-2">1.</span> Monolithic Design</h2>
<div class="outline-text-2" id="text-1">
<p>
One big application.
Each instance can handle any request on its own (other than help from DB).
</p>

<p>
When developer is testing new code, they can run one instance locally.
</p>

<p>
Monolithic design is easy to build, deploy, test, coordinate, and share data.
</p>

<p>
Monolithic disadvantages:
</p>
<ul class="org-ul">
<li>creates bottlenecks during development
<ul class="org-ul">
<li>many devs working on one codebase</li>
</ul></li>
<li>big codebase can lead to messy, fragile code</li>
<li>whole app must be redeployed for small new functionality</li>
<li>must choose one programming language, build system, runtime env</li>
</ul>
</div>
</div>
<div id="outline-container-orge1788cf" class="outline-2">
<h2 id="orge1788cf"><span class="section-number-2">2.</span> Microservices</h2>
<div class="outline-text-2" id="text-2">
<p>
In <b>Service Oriented Architecture</b>, many smaller services work together.
</p>

<p>
Responsibilities split among specialized services.
</p>

<p>
To outside world, looks like one application.
</p>

<p>
Each <b>microservice</b> is a black box to the rest of the system, and handles requests from the network
(implementation hidden).
Language-independent network-level API needed to specify format of requests and responses.
</p>

<p>
Microservice disadvantages:
</p>
<ul class="org-ul">
<li>more difficult to trace request handling code for debugging, since it spans many apps
<ul class="org-ul">
<li>but easier to test smaller services</li>
</ul></li>
<li>ACID transactions more difficult to support
<ul class="org-ul">
<li>monolithic design can manage a single DB connection with a transaction that can be rolled back</li>
</ul></li>
<li>devs get isolated in sub-projects, blocking collaboration and innovation</li>
</ul>

<p>
Microservices isolate codebases with clear network API boundares, allowing parallel work.
</p>

<p>
When starting a new project:
</p>
<ul class="org-ul">
<li>organize system into services and DBs</li>
<li>agree on network-level API for each service</li>
<li>assign engineers to each service and build independently</li>
</ul>

<p>
If application interacts with service under construction, can build <b>mock</b> of service (returns
hard-coded data for testing).
</p>

<p>
Traditional web-app generates HTML on server.
For JS single-page app, JS app runs in browser and makes REST requests and generates HTML.
</p>

<p>
Service API (REST, GraphQL) essential for supporting mobile and desktop apps with cloud-based data
and services.
</p>

<p>
Single API can handle all client types.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-07 Sat 18:34</p>
</div>
</body>
</html>
